---
kind: other
id: Methods.T:Autodesk.Revit.DB.Rectangle
source: html/277d71cb-32f5-f314-d789-1b64076c9828.htm
---
# Rectangle Methods

Returns true if the rectangle coordinates are normalized to the screen coordinate space; that is, left is less than right and top is less than bottom.